// App.js e датотека koja создава објект за експресна апликација, ја поставува истата со различни поставки и
//  на крај прави експорт од модулот.
// Во самата датотека, најпрвин се прави импорт на библиотеки со користејки "require".

// Потоа следат функции со app.use () со кои се додаваат библиотеките на средниот софтвер во синџирот за управување со барањата.

// Откако ќе биде поставен целиот среден софтвер, се додава код за управување со маршрутата во синџирот за управување со барањата. 
// Последниот среден софтвер во датотеката додава методи за управување со грешки и HTTP 404 одговори.
// Последниот чекор го додава во извозот на модулот 

// Апликацијата Express е целосно конфигурирана.



// Датотеката /bin од www датотеката е стартна точка на апликацијата!
// Во овој фајл најпрво, со користење на "require" точка ја внесува апликацијата app.js што ги поставува и враќа објектите на апликацијата express.
// Останатиот кодот во овој фајл поставува HTTP сервер со апликација на localhost 3000, со што започнува со примање и известување за можните грешки и врски на серверот.